БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭлектронныеПисьмаДляОбработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритерийОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КритерииОтбораЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>Идентификатор письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработкиПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДД</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MIME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОбработкиПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОбработкиПочтовыхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОбработки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ЗагрузитьСеансовыеНастройки();
	_НастройкаСписка();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	_СохранитьСеансовыеНастройки();
	
КонецПроцедуры

&НаСервере
Функция _СохранитьСеансовыеНастройки()
	// --- 
	
	СтруктураНастроекФормы = Новый Структура;
	СтруктураНастроекФормы.Вставить("ТолькоНовые",ТолькоНовые);
	
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",СтруктураНастроекФормы,,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовыеНастройки()
	// --- 
	
	ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	Если ПоследняяНастройка <> Неопределено Тогда
		
		ТолькоНовые = ПоследняяНастройка.ТолькоНовые;
		
	КонецЕсли; 
	
	
	// --- 
КонецФункции
 
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТолькоНовые(Команда)
	
	ТолькоНовые = НЕ ТолькоНовые;
	_НастройкаСписка();
	
КонецПроцедуры

&НаСервере
Процедура _НастройкаСписка()
	// --- 
	
	Элементы.ФормаТолькоНовые.Пометка = ТолькоНовые;
		
	Если ТолькоНовые Тогда
		
		ОДС = _УФС.ДобавитьОтбор(Список.Отбор,"СтатусОбработки",,Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки);
		ИдентификаторОтбора = ПоместитьВоВременноеХранилище(Список.Отбор.ПолучитьИдентификаторПоОбъекту(ОДС),УникальныйИдентификатор);
		
	Иначе
		
		Если ИдентификаторОтбора <> "" Тогда
			
			Список.Отбор.Элементы.Удалить(Список.Отбор.ПолучитьОбъектПоИдентификатору(ПолучитьИзВременногоХранилища(ИдентификаторОтбора)));
			
		КонецЕсли; 
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораСтатуса",ЭтотОбъект); 
	ПолучитьСписокСтатусов().ПоказатьВыборЭлемента(ПОВ,"Новый статус");;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтатуса(Результат, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Результат <> Неопределено Тогда
		
		МассивЭлементов = Новый Массив;
		Для каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
			
			МассивЭлементов.Добавить(Стр);
			
		КонецЦикла; 
		
		_УстановитьСтатус(МассивЭлементов,Результат.Значение);
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервереБезКонтекста
Функция ПолучитьСписокСтатусов()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ПустаяСсылка(),"<без статуса>");
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки,"Ошибка обработки");
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Завершено,"Завершено");
	
	Возврат(СписокВыбора);
	
КонецФункции
 

&НаСервере
Процедура _УстановитьСтатус(МассивЭлементов,Статус)
	// --- 
	
	Для каждого Стр Из МассивЭлементов Цикл
		
		Письмо = Стр.ПолучитьОбъект();
		Письмо.СтатусОбработки = Статус;
		Письмо.Записать();
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
